app/Controllers/AuthAdminController.php

SELECT *
FROM `compte_admin`
WHERE `email` = 'admin@example.com'
 LIMIT 1
---
    public function authenticate()
    {
        $session = session();
        $model = new CompteAdminModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $admin = $model->where('email', $email)->first();